Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: طسم
en: Ta-Sin-Mim. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings.]

source: تلك آيات الكتاب المبين
en: These are the Verses of the manifest Book [(this Qur'an), which was promised by Allah in the Taurat (Torah) and the Injeel (Gospel), makes things clear].

source: لعلك باخع نفسك ألا يكونوا مؤمنين
en: It may be that you (O Muhammad صلى الله عليه وسلم) are going to kill yourself with grief, that they do not become believers [in your Risalah (Messengership) i.e. in your Message of Islamic Monotheism].

source: إن نشأ ننزل عليهم من السماء آية فظلت أعناقهم لها خاضعين
en: If We will, We could send down to them from the heaven a sign, to which they would bend their necks in humility.

source: وما يأتيهم من ذكر من الرحمن محدث إلا كانوا عنه معرضين
en: And never comes there unto them a Reminder as a recent revelation from the Most Gracious (Allah), but they turn away therefrom.

source: فقد كذبوا فسيأتيهم أنباء ما كانوا به يستهزئون
en: So they have indeed denied (the truth - this Qur'an), then the news of what they mocked at will come to them.

source: أولم يروا إلى الأرض كم أنبتنا فيها من كل زوج كريم
en: Do they not observe the earth - how much of every good kind We cause to grow therein?

source: إن في ذلك لآية وما كان أكثرهم مؤمنين
en: Verily, in this is an Ayah (proof or sign), yet most of them (polytheists, pagans who do not believe in Resurrection) are not believers.

source: وإن ربك لهو العزيز الرحيم
en: And verily your Lord, He is truly the All-Mighty, the Most Merciful.

source: وإذ نادى ربك موسى أن ائت القوم الظالمين
en: And (remember) when your Lord called Musa (Moses) (saying): "Go to the people who are Zalimun (polytheists and wrong-doers) -

source: قوم فرعون ألا يتقون
en: "The people of Fir'aun (Pharaoh): Will they not fear Allah and become righteous?"

source: قال رب إني أخاف أن يكذبون
en: He said: "My Lord! Verily, I fear that they will belie me,

source: ويضيق صدري ولا ينطلق لساني فأرسل إلى هارون
en: "And my breast straitens, and my tongue expresses not well. So send for Harun (Aaron) (to come along with me).

source: ولهم علي ذنب فأخاف أن يقتلون
en: "And they have a charge of crime against me, and I fear they will kill me."

source: قال كلا فاذهبا بآياتنا إنا معكم مستمعون
en: (Allah) said: "Nay! Go you both with Our Signs. Verily We shall be with you, listening.

source: فأتيا فرعون فقولا إنا رسول رب العالمين
en: "And go both of you to Fir'aun (Pharaoh), and say: 'We are the Messengers of the Lord of the 'Alamin (mankind, jinn and all that exists),

source: أن أرسل معنا بني إسرائيل
en: "So allow the Children of Israel to go with us.' "

source: قال ألم نربك فينا وليدا ولبثت فينا من عمرك سنين
en: [Fir'aun (Pharaoh)] said [to Musa (Moses)]: "Did we not bring you up among us as a child? And you did dwell many years of your life with us.

source: وفعلت فعلتك التي فعلت وأنت من الكافرين
en: "And you did your deed, which you did (i.e. the crime of killing a man) while you were one of the ingrates."

source: قال فعلتها إذا وأنا من الضالين
en: Musa (Moses) said: "I did it then, when I was ignorant (as regards my Lord and His Message).

source: ففررت منكم لما خفتكم فوهب لي ربي حكما وجعلني من المرسلين
en: "So I fled from you when I feared you. But my Lord has granted me Hukm (i.e. religious knowledge, right judgement of the affairs and Prophethood), and made me one of the Messengers.

source: وتلك نعمة تمنها علي أن عبدت بني إسرائيل
en: "And this is the past favour with which you reproach me: that you have enslaved the Children of Israel."

source: قال فرعون وما رب العالمين
en: Fir'aun (Pharaoh) said: "And what is the Lord of the 'Alamin (mankind, jinn and all that exists)?"

source: قال رب السماوات والأرض وما بينهما إن كنتم موقنين
en: [Musa (Moses)] said: "The Lord of the heavens and the earth, and all that is between them, if you seek to be convinced with certainty."

source: قال لمن حوله ألا تستمعون
en: [Fir'aun (Pharaoh)] said to those around: "Do you not hear (what he says)?"

source: قال ربكم ورب آبائكم الأولين
en: [Musa (Moses)] said: "Your Lord and the Lord of your ancient fathers!"

source: قال إن رسولكم الذي أرسل إليكم لمجنون
en: [Fir'aun (Pharaoh)] said: "Verily, your Messenger who has been sent to you is a madman!"

source: قال رب المشرق والمغرب وما بينهما إن كنتم تعقلون
en: [Musa (Moses)] said: "Lord of the east and the west, and all that is between them, if you did but understand!"

source: قال لئن اتخذت إلها غيري لأجعلنك من المسجونين
en: [Fir'aun (Pharaoh)] said: "If you choose an ilah (god) other than me, I will certainly put you among the prisoners."

source: قال أولو جئتك بشيء مبين
en: [Musa (Moses)] said: "Even if I bring you something manifest (and convincing)?"

source: قال فأت به إن كنت من الصادقين
en: [Fir'aun (Pharaoh)] said: "Bring it forth then, if you are of the truthful!"

source: قال للملإ حوله إن هذا لساحر عليم
en: [Fir'aun (Pharaoh)] said to the chiefs around him: "Verily! This is indeed a well-versed sorcerer.

source: يريد أن يخرجكم من أرضكم بسحره فماذا تأمرون
en: "He wants to drive you out of your land by his sorcery: what is it then that you command?"

source: قالوا أرجه وأخاه وابعث في المدائن حاشرين
en: They said: "Put him off and his brother (for a while), and send callers to the cities;

source: يأتوك بكل سحار عليم
en: "To bring up to you every well-versed sorcerer."

source: فجمع السحرة لميقات يوم معلوم
en: So the sorcerers were assembled at a fixed time on a day appointed.

source: وقيل للناس هل أنتم مجتمعون
en: And it was said to the people: "Are you (too) going to assemble?

source: لعلنا نتبع السحرة إن كانوا هم الغالبين
en: "That we may follow the sorcerers [who were on Fir'aun's (Pharaoh) religion of disbelief] if they are the winners."

source: فلما جاء السحرة قالوا لفرعون أئن لنا لأجرا إن كنا نحن الغالبين
en: So when the sorcerers arrived, they said to Fir'aun (Pharaoh): "Will there surely be a reward for us if we are the winners?"

source: قال نعم وإنكم إذا لمن المقربين
en: He said: "Yes, and you shall then verily be of those brought near (to myself)."

source: قال لهم موسى ألقوا ما أنتم ملقون
en: Musa (Moses) said to them: "Throw what you are going to throw!"

source: فألقوا حبالهم وعصيهم وقالوا بعزة فرعون إنا لنحن الغالبون
en: So they threw their ropes and their sticks, and said: "By the might of Fir'aun (Pharaoh), it is we who will certainly win!"

source: فألقى موسى عصاه فإذا هي تلقف ما يأفكون
en: Then Musa (Moses) threw his stick, and behold, it swallowed up all that they falsely showed!

source: فألقي السحرة ساجدين
en: And the sorcerers fell down prostrate.

source: قال آمنتم له قبل أن آذن لكم إنه لكبيركم الذي علمكم السحر فلسوف تعلمون لأقطعن أيديكم وأرجلكم من خلاف ولأصلبنكم أجمعين
en: [Fir'aun (Pharaoh)] said: "You have believed in him before I give you leave. Surely, he indeed is your chief, who has taught you magic! So verily, you shall come to know. Verily, I will cut off your hands and your feet on opposite sides, and I will crucify you all."

source: قالوا لا ضير إنا إلى ربنا منقلبون
en: They said: "No harm! Surely, to our Lord (Allah) we are to return.

source: إنا نطمع أن يغفر لنا ربنا خطايانا أن كنا أول المؤمنين
en: "Verily we really hope that our Lord will forgive us our sins, as we are the first of the believers [in Musa (Moses) and in the Monotheism which he has brought from Allah]."

source: وأوحينا إلى موسى أن أسر بعبادي إنكم متبعون
en: And We revealed to Musa (Moses), saying: "Depart by night with My slaves, verily you will be pursued."

source: فأرسل فرعون في المدائن حاشرين
en: Then Fir'aun (Pharaoh) sent callers to (all) the cities.

source: إن هؤلاء لشرذمة قليلون
en: (Saying): "Verily these indeed are but a small band.

source: وإنهم لنا لغائظون
en: "And verily, they have done what has enraged us.

source: وإنا لجميع حاذرون
en: "But we are a host all assembled, amply fore-warned."

source: فأخرجناهم من جنات وعيون
en: So, We expelled them from gardens and springs,

source: وكنوز ومقام كريم
en: Treasures, and every kind of honourable place.

source: كذلك وأورثناها بني إسرائيل
en: Thus [We turned them (Pharaoh's people) out] and We caused the Children of Israel to inherit them.

source: فأتبعوهم مشرقين
en: So they pursued them at sunrise.

source: فلما تراءى الجمعان قال أصحاب موسى إنا لمدركون
en: And when the two hosts saw each other, the companions of Musa (Moses) said: "We are sure to be overtaken."

source: قال كلا إن معي ربي سيهدين
en: [Musa (Moses)] said: "Nay, verily with me is my Lord. He will guide me."

source: فأوحينا إلى موسى أن اضرب بعصاك البحر فانفلق فكان كل فرق كالطود العظيم
en: Then We revealed to Musa (Moses) (saying): "Strike the sea with your stick." And it parted, and each separate part (of that sea water) became like huge mountain.

source: وأزلفنا ثم الآخرين
en: Then We brought near the others [Fir'aun's (Pharaoh) party] to that place.

source: وأنجينا موسى ومن معه أجمعين
en: And We saved Musa (Moses) and all those with him.

source: ثم أغرقنا الآخرين
en: Then We drowned the others.

source: واتل عليهم نبأ إبراهيم
en: And recite to them the story of Ibrahim (Abraham).

source: إذ قال لأبيه وقومه ما تعبدون
en: When he said to his father and his people: "What do you worship?"

source: قالوا نعبد أصناما فنظل لها عاكفين
en: They said: "We worship idols, and to them we are ever devoted."

source: قال هل يسمعونكم إذ تدعون
en: He said: "Do they hear you, when you call on (them)?

source: أو ينفعونكم أو يضرون
en: "Or do they benefit you or do they harm (you)?"

source: قالوا بل وجدنا آباءنا كذلك يفعلون
en: They said: "(Nay) but we found our fathers doing so."

source: قال أفرأيتم ما كنتم تعبدون
en: He said: "Do you observe that which you have been worshipping -

source: أنتم وآباؤكم الأقدمون
en: "You and your ancient fathers?

source: فإنهم عدو لي إلا رب العالمين
en: "Verily they are enemies to me, save the Lord of the 'Alamin (mankind, jinn and all that exists),

source: الذي خلقني فهو يهدين
en: "Who has created me, and it is He Who guides me.

source: والذي هو يطعمني ويسقين
en: "And it is He Who feeds me and gives me to drink.

source: وإذا مرضت فهو يشفين
en: "And when I am ill, it is He who cures me.

source: والذي يميتني ثم يحيين
en: "And Who will cause me to die, and then will bring me to life (again).

source: والذي أطمع أن يغفر لي خطيئتي يوم الدين
en: "And Who, I hope, will forgive me my faults on the Day of Recompense, (the Day of Resurrection).

source: رب هب لي حكما وألحقني بالصالحين
en: My Lord! Bestow Hukm (religious knowledge, right judgement of the affairs and Prophethood) on me, and join me with the righteous.

source: واجعل لي لسان صدق في الآخرين
en: And grant me an honourable mention in later generations.

source: واجعلني من ورثة جنة النعيم
en: And make me one of the inheritors of the Paradise of Delight.

source: واغفر لأبي إنه كان من الضالين
en: And forgive my father, verily he is of the erring.

source: ولا تخزني يوم يبعثون
en: And disgrace me not on the Day when (all the creatures) will be resurrected.

source: يوم لا ينفع مال ولا بنون
en: The Day whereon neither wealth nor sons will avail,

source: إلا من أتى الله بقلب سليم
en: Except him who brings to Allah a clean heart [clean from Shirk (polytheism) and Nifaq (hypocrisy)]."

source: وأزلفت الجنة للمتقين
en: And Paradise will be brought near to the Muttaqun (the pious - See V.2:2).

source: وبرزت الجحيم للغاوين
en: And the (Hell) Fire will be placed in full view of the erring.

source: وقيل لهم أين ما كنتم تعبدون
en: And it will be said to them: "Where are those (the false gods whom you used to set up as rivals with Allah) that you used to worship.

source: من دون الله هل ينصرونكم أو ينتصرون
en: "Instead of Allah? Can they help you or (even) help themselves?"

source: فكبكبوا فيها هم والغاوون
en: Then they will be thrown on their faces into the (Fire), they and the Ghawun (devils, and those who were in error).

source: وجنود إبليس أجمعون
en: And the whole hosts of Iblis (Satan) together.

source: قالوا وهم فيها يختصمون
en: They will say while contending therein,

source: تالله إن كنا لفي ضلال مبين
en: By Allah, we were truly in a manifest error,

source: إذ نسويكم برب العالمين
en: When We held you (false gods) as equals (in worship) with the Lord of the 'Alamin (mankind, jinn and all that exists);

source: وما أضلنا إلا المجرمون
en: And none has brought us into error except the Mujrimun [Iblis (Satan) and those of human beings who commit crimes, murderers, polytheists, oppressors].

source: فما لنا من شافعين
en: Now we have no intercessors,

source: ولا صديق حميم
en: Nor a close friend (to help us).

source: فلو أن لنا كرة فنكون من المؤمنين
en: (Alas!) If we only had a chance to return (to the world), we shall truly be among the believers!

source: كذبت قوم نوح المرسلين
en: The people of Nuh (Noah) belied the Messengers.

source: إذ قال لهم أخوهم نوح ألا تتقون
en: When their brother Nuh (Noah) said to them: "Will you not fear Allah and obey Him?

source: إني لكم رسول أمين
en: "I am a trustworthy Messenger to you.

source: فاتقوا الله وأطيعون
en: "So fear Allah, keep your duty to Him, and obey me.

source: وما أسألكم عليه من أجر إن أجري إلا على رب العالمين
en: "No reward do I ask of you for it (my Message of Islamic Monotheism); my reward is only from the Lord of the 'Alamin (mankind, jinn and all that exists).

source: قالوا أنؤمن لك واتبعك الأرذلون
en: They said: "Shall we believe in you, when the meanest (of the people) follow you?"

source: قال وما علمي بما كانوا يعملون
en: He said: "And what knowledge have I of what they used to do?

source: إن حسابهم إلا على ربي لو تشعرون
en: "Their account is only with my Lord, if you could (but) know.

source: وما أنا بطارد المؤمنين
en: "And I am not going to drive away the believers.

source: إن أنا إلا نذير مبين
en: I am only a plain warner."

source: قالوا لئن لم تنته يا نوح لتكونن من المرجومين
en: They said: "If you cease not, O Nuh (Noah) you will surely be among those stoned (to death)."

source: قال رب إن قومي كذبون
en: He said: "My Lord! Verily, my people have belied me.

source: فافتح بيني وبينهم فتحا ونجني ومن معي من المؤمنين
en: Therefore judge You between me and them, and save me and those of the believers who are with me."

source: فأنجيناه ومن معه في الفلك المشحون
en: And We saved him and those with him in the laden ship.

source: ثم أغرقنا بعد الباقين
en: Then We drowned the rest (disbelievers) thereafter.

source: كذبت عاد المرسلين
en: 'Ad (people) belied the Messengers.

source: إذ قال لهم أخوهم هود ألا تتقون
en: When their brother Hud said to them: "Will you not fear Allah and obey Him?

source: أتبنون بكل ريع آية تعبثون
en: "Do you build high palaces on every high place, while you do not live in them?

source: وتتخذون مصانع لعلكم تخلدون
en: "And do you get for yourselves palaces (fine buildings) as if you will live therein for ever.

source: وإذا بطشتم بطشتم جبارين
en: "And when you seize (somebody), seize you (him) as tyrants?

source: واتقوا الذي أمدكم بما تعلمون
en: "And keep your duty to Him, fear Him Who has aided you with all (good things) that you know.

source: أمدكم بأنعام وبنين
en: "He has aided you with cattle and children.

source: وجنات وعيون
en: "And gardens and springs.

source: إني أخاف عليكم عذاب يوم عظيم
en: "Verily, I fear for you the torment of a Great Day."

source: قالوا سواء علينا أوعظت أم لم تكن من الواعظين
en: They said: "It is the same to us whether you preach or be not of those who preach.

source: إن هذا إلا خلق الأولين
en: "This is no other than the false tales and religion of the ancients, [Tafsir At-Tabari]

source: وما نحن بمعذبين
en: "And we are not going to be punished."

source: فكذبوه فأهلكناهم إن في ذلك لآية وما كان أكثرهم مؤمنين
en: So they belied him, and We destroyed them. Verily in this is indeed a sign, yet most of them are not believers.

source: كذبت ثمود المرسلين
en: Thamud (people) belied the Messengers.

source: إذ قال لهم أخوهم صالح ألا تتقون
en: When their brother Salih said to them: "Will you not fear Allah and obey Him?

source: أتتركون في ما هاهنا آمنين
en: "Will you be left secure in that which you have here?

source: في جنات وعيون
en: "In gardens and springs.

source: وزروع ونخل طلعها هضيم
en: And green crops (fields) and date-palms with soft spadix.

source: وتنحتون من الجبال بيوتا فارهين
en: "And you hew out in the mountains, houses with great skill.

source: ولا تطيعوا أمر المسرفين
en: "And follow not the command of Al-Musrifun [i.e. their chiefs: leaders who were polytheists, criminals and sinners],

source: الذين يفسدون في الأرض ولا يصلحون
en: "Who make mischief in the land, and reform not."

source: قالوا إنما أنت من المسحرين
en: They said: "You are only of those bewitched!

source: ما أنت إلا بشر مثلنا فأت بآية إن كنت من الصادقين
en: "You are but a human being like us. Then bring us a sign if you are of the truthful."

source: قال هذه ناقة لها شرب ولكم شرب يوم معلوم
en: He said: "Here is a she-camel: it has a right to drink (water), and you have a right to drink (water) (each) on a day, known.

source: ولا تمسوها بسوء فيأخذكم عذاب يوم عظيم
en: "And touch her not with harm, lest the torment of a Great Day should seize you."

source: فعقروها فأصبحوا نادمين
en: But they killed her, and then they became regretful.

source: فأخذهم العذاب إن في ذلك لآية وما كان أكثرهم مؤمنين
en: So the torment overtook them. Verily, in this is indeed a sign, yet most of them are not believers.

source: كذبت قوم لوط المرسلين
en: The people of Lut (Lot) (-who dwelt in the town of Sodom in Palestine) belied the Messengers.

source: إذ قال لهم أخوهم لوط ألا تتقون
en: When their brother Lut (Lot) said to them: "Will you not fear Allah and obey Him?

source: أتأتون الذكران من العالمين
en: "Go you in unto the males of the 'Alamin (mankind),

source: وتذرون ما خلق لكم ربكم من أزواجكم بل أنتم قوم عادون
en: "And leave those whom Allah has created for you to be your wives? Nay, you are a trespassing people!"

source: قالوا لئن لم تنته يا لوط لتكونن من المخرجين
en: They said: "If you cease not O Lut (Lot)! verily, you will be one of those who are driven out!"

source: قال إني لعملكم من القالين
en: He said: "I am, indeed, of those who disapprove with severe anger and fury your (this evil) action (of sodomy).

source: رب نجني وأهلي مما يعملون
en: "My Lord! Save me and my family from what they do."

source: فنجيناه وأهله أجمعين
en: So We saved him and his family, all,

source: إلا عجوزا في الغابرين
en: Except an old woman (his wife) among those who remained behind.

source: ثم دمرنا الآخرين
en: Then afterward We destroyed the others.

source: وأمطرنا عليهم مطرا فساء مطر المنذرين
en: And We rained on them a rain (of torment). And how evil was the rain of those who had been warned!

source: كذب أصحاب الأيكة المرسلين
en: The dwellers of Al-Aikah [near Madyan (Midian)] belied the Messengers.

source: إذ قال لهم شعيب ألا تتقون
en: When Shu'aib said to them: "Will you not fear Allah (and obey Him)?

source: أوفوا الكيل ولا تكونوا من المخسرين
en: "Give full measure, and cause no loss (to others).

source: وزنوا بالقسطاس المستقيم
en: "And weigh with the true and straight balance.

source: ولا تبخسوا الناس أشياءهم ولا تعثوا في الأرض مفسدين
en: "And defraud not people by reducing their things, nor do evil, making corruption and mischief in the land.

source: واتقوا الذي خلقكم والجبلة الأولين
en: "And fear Him Who created you and the generations of the men of old."

source: وما أنت إلا بشر مثلنا وإن نظنك لمن الكاذبين
en: "You are but a human being like us and verily, we think that you are one of the liars!

source: فأسقط علينا كسفا من السماء إن كنت من الصادقين
en: "So cause a piece of the heaven to fall on us, if you are of the truthful!"

source: قال ربي أعلم بما تعملون
en: He said: "My Lord is the Best Knower of what you do."

source: فكذبوه فأخذهم عذاب يوم الظلة إنه كان عذاب يوم عظيم
en: But they belied him, so the torment of the day of shadow (a gloomy cloud) seized them. Indeed that was the torment of a Great Day.

source: وإنه لتنزيل رب العالمين
en: And truly, this (the Qur'an) is a revelation from the Lord of the 'Alamin (mankind, jinn and all that exists),

source: نزل به الروح الأمين
en: Which the trustworthy Ruh [Jibril (Gabriel)] has brought down

source: على قلبك لتكون من المنذرين
en: Upon your heart (O Muhammad صلى الله عليه وسلم) that you may be (one) of the warners,

source: بلسان عربي مبين
en: In the plain Arabic language.

source: وإنه لفي زبر الأولين
en: And verily, it (the Qur'an, and its revelation to Prophet Muhammad صلى الله عليه وسلم) is (announced) in the Scriptures [i.e. the Taurat (Torah) and the Injeel (Gospel)] of former people.

source: أولم يكن لهم آية أن يعلمه علماء بني إسرائيل
en: Is it not a sign to them that the learned scholars (like 'Abdullah bin Salam رضي الله عنه who embraced Islam) of the Children of Israel knew it (as true)?

source: ولو نزلناه على بعض الأعجمين
en: And if We had revealed it (this Qur'an) unto any of the non-Arabs,

source: فقرأه عليهم ما كانوا به مؤمنين
en: And he had recited it unto them, they would not have believed in it.

source: كذلك سلكناه في قلوب المجرمين
en: Thus have We caused it (the denial of the Qur'an) to enter the hearts of the Mujrimun (criminals, polytheists, sinners).

source: لا يؤمنون به حتى يروا العذاب الأليم
en: They will not believe in it until they see the painful torment.

source: فيأتيهم بغتة وهم لا يشعرون
en: It shall come to them of a sudden, while they perceive it not.

source: فيقولوا هل نحن منظرون
en: Then they will say: "Can we be respited?"

source: أفبعذابنا يستعجلون
en: Would they then wish for Our Torment to be hastened on?

source: أفرأيت إن متعناهم سنين
en: Tell Me, (even) if We do let them enjoy for years,

source: ثم جاءهم ما كانوا يوعدون
en: And afterwards comes to them that (punishment) which they had been promised,

source: ما أغنى عنهم ما كانوا يمتعون
en: All that with which they used to enjoy shall not avail them.

source: وما أهلكنا من قرية إلا لها منذرون
en: And never did We destroy a township but it had its warners

source: ذكرى وما كنا ظالمين
en: By way of reminder, and We have never been unjust.

source: وما تنزلت به الشياطين
en: And it is not the Shayatin (devils) who have brought it (this Qur'an) down.

source: وما ينبغي لهم وما يستطيعون
en: Neither would it suit them, nor they can (produce it).

source: إنهم عن السمع لمعزولون
en: Verily, they have been removed far from hearing it.

source: فلا تدع مع الله إلها آخر فتكون من المعذبين
en: So invoke not with Allah another ilah (god) lest you should be among those who receive punishment.

source: وأنذر عشيرتك الأقربين
en: And warn your tribe (O Muhammad صلى الله عليه وسلم) of near kindred.

source: واخفض جناحك لمن اتبعك من المؤمنين
en: And be kind and humble to the believers who follow you.

source: فإن عصوك فقل إني بريء مما تعملون
en: Then if they disobey you, say: "I am innocent of what you do."

source: وتوكل على العزيز الرحيم
en: And put your trust in the All-Mighty, the Most Merciful,

source: الذي يراك حين تقوم
en: Who sees you (O Muhammad صلى الله عليه وسلم) when you stand up (alone at night for Tahajjud prayers).

source: وتقلبك في الساجدين
en: And your movements among those who fall prostrate (to Allah in the five compulsory congregational prayers).

source: إنه هو السميع العليم
en: Verily He, only He, is the All-Hearer, the All-Knower.

source: هل أنبئكم على من تنزل الشياطين
en: Shall I inform you (O people!) upon whom the Shayatin (devils) descend?

source: تنزل على كل أفاك أثيم
en: They descend on every lying, sinful person.

source: يلقون السمع وأكثرهم كاذبون
en: Who gives ear (to the devils and they pour what they may have heard of the Unseen from the angels), and most of them are liars.

source: والشعراء يتبعهم الغاوون
en: As for the poets, the erring ones follow them,

source: ألم تر أنهم في كل واد يهيمون
en: See you not that they speak about every subject (praising people - right or wrong) in their poetry?
